In [1]:
import pandas as pd

In [24]:
#df=pd.read_csv('ftp://192.168.10.254/pub/winter19-20/datasets/info.csv')    #local path or url
#''
df=pd.read_csv('E:\winter_session\info.csv')

In [4]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
df.head(3)   #for only top 3 lines

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [6]:
df.head()vv#by default 5 rows

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [8]:
#for any specific column
df['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [9]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [11]:
df.iloc[1:3]  #any specific range of rows   in head it reads from 0

   Country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [12]:
df.iloc[0:3,0:3]   #specific rows and columns

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0

In [14]:
df.iloc[1:4,0:2]

   Country   Age
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0

In [15]:
df.iloc[[3,5],[1,2]]

    Age   Salary
3  38.0  61000.0
5  35.0  58000.0

In [16]:
df.iloc[[1,3,5],[2,3]]

    Salary Purchased
1  48000.0       Yes
3  61000.0        No
5  58000.0       Yes

In [17]:
df.iloc[[3,5],[1,2]].values

array([[3.8e+01, 6.1e+04],
       [3.5e+01, 5.8e+04]])

In [20]:
max(df['Age'])

50.0

In [21]:
min(df['Age'])

27.0

In [22]:
[i for i in dir(pd) if 'read' in i]

['read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table']